[
  {
    "episode": "Tech4HumansTrailer",
    "shortName": "Trailer",
    "additionalContent": "",
    "note": "",
    "transcript": ""
  },
  {
    "episode": "Tech4HumansEpisode0",
    "shortName": "Episode 0",
    "additionalContent": "<a href='https://twitter.com/Tech4humansio'> Follow Tech4Humans on Twitter </a> <a href='https://twitter.com/Rahatcodes'> Follow Rahat on Twitter </a> <a href='https://twitter.com/hasibulch'> Follow Hasibul on Twitter </a> <a href='https://www.rahatcodes.com/'> Rahat Codes Livestream Archive </a>",
    "note": "",
    "transcript": "<p>Rahat Chowdhury &nbsp;0:15 &nbsp;</p> <p>Hey, I&#39;m Rahat.&nbsp;</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;0:17 &nbsp;</p> <p>Hi, I&#39;m Hasibul.&nbsp;</p> <p><br></p> <p>Rahat Chowdhury &nbsp;0:18 &nbsp;</p> <p>And you&#39;re listening to Tech4Humans.</p> <p><br></p> <p>Welcome to Episode zero of tech for humans. My name is Rahat.</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;0:26 &nbsp;</p> <p>My name is Hasibul.</p> <p><br></p> <p>Rahat Chowdhury &nbsp;0:28 &nbsp;</p> <p>And we&#39;re the co host of tech for humans. So Hasibul, What...what exactly is tech for humans?</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;0:36 &nbsp;</p> <p>Don&#39;t know. You tell me. It&#39;s your idea. You kind of dragged me into this, you know, didn&#39;t give me any choice.</p> <p><br></p> <p>Rahat Chowdhury &nbsp;0:43 &nbsp;</p> <p>I wouldn&#39;t have called it drag.</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;0:45 &nbsp;</p> <p>Okay, you rolled me into this. Okay.</p> <p><br></p> <p>Rahat Chowdhury &nbsp;0:47 &nbsp;</p> <p>Yeah, that&#39;s more accurate. So, I had an idea to do a podcast. And I had no idea what I wanted to do this podcast, so I just wanted to do a podcast. Eventually I got another idea. I wanted to feature people who were just doing good things for humanity. People who may have been doing things for, I guess, marginalized people, maybe for climate change, maybe in the mental health space. And these are some of the people who sought out to feature on episodes on this podcast. And yeah, that&#39;s pretty much the theme that we&#39;ve got going on and the vision that I had for this whole thing. So Hasibul, why are you here?</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;1:25 &nbsp;</p> <p>I think it all started back in 2005.</p> <p><br></p> <p>Rahat Chowdhury &nbsp;1:28 &nbsp;</p> <p>That&#39;s a long time ago&nbsp;</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;1:30 &nbsp;</p> <p>September. I think it was English class</p> <p><br></p> <p>Rahat Chowdhury &nbsp;1:34 &nbsp;</p> <p>Yeah English class.</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;1:36 &nbsp;</p> <p>And you sit in front of me&nbsp;</p> <p><br></p> <p>Rahat Chowdhury &nbsp;1:37 &nbsp;</p> <p>No I sat to the left of you, or you were to the left or I was to the right of you.</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;1:41 &nbsp;</p> <p>I don&#39;t know. We have like a billion classes together.</p> <p><br></p> <p>But yes, started all back then. No,all jokes aside.</p> <p><br></p> <p>Rahat Chowdhury &nbsp;1:53 &nbsp;</p> <p>15 years...</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;1:54 &nbsp;</p> <p>It&#39;s almost 20. I&#39;m sorry. It&#39;s almost 2020. So it would so it &nbsp;hasn&#39;t been 15 years yet. It would have been 15 years and it will be in September. You&#39;re really bad with dates.</p> <p><br></p> <p>Rahat Chowdhury &nbsp;2:07 &nbsp;</p> <p>I&#39;m terrible at dates. Yeah.</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;2:12 &nbsp;</p> <p>But all jokes aside, you know, when you came to me with this, it&#39;s on a really cool. And like I mentioned with you before, like, I want an outlet to be there for everyone, you know, all different groups and walks of lives and especially, you know, marginalized groups, especially like, with us being people of color if you&#39;re like, No, there isn&#39;t a big tech scene for us. Well, yeah, we&#39;re Asian man. And it&#39;s kind of easier for us to get into tech. But just people color in general. It&#39;s not as easy and a lot of the roadblocks are in place to make it hard for us or people. Like us to get into tech and I feel like giving a voice orjust giving an outlet or creating an outletfor groups and people like us would be great. I you know, especially with one of our most recent podcasts that are recorded, you know, it felt really good to talk about a lot of stuff we&#39;ve been dealing with,&nbsp;</p> <p><br></p> <p>Rahat Chowdhury &nbsp;3:20 &nbsp;</p> <p>Don&#39;t give them spoilers...</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;3:23 &nbsp;</p> <p>Well, I try to be as like, spoiler free as possible.</p> <p><br></p> <p>Rahat Chowdhury &nbsp;3:29 &nbsp;</p> <p>Hasilbul &nbsp;has a tendency to give spoilers out</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;3:32 &nbsp;</p> <p>Yea just like how Snape kills Dumbledore.&nbsp;</p> <p><br></p> <p>Rahat Chowdhury &nbsp;3:36 &nbsp;</p> <p>Come on. There are people who may not have read it yet.</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;3:40 &nbsp;</p> <p>You know, it&#39;s been out for over a decade if they haven&#39;t read it or seen it by now. They&#39;re never gonna do it.&nbsp;</p> <p><br></p> <p>Rahat Chowdhury &nbsp;3:46 &nbsp;</p> <p>There are new generations of people.All the time</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;3:49 &nbsp;</p> <p>Oh, they&#39;ve they&#39;ve already seen those spoilers. Tell me not, that half like what half the tweets or like Twitter memes or even reddit memes are about how Snape killed Dumbledore.</p> <p><br></p> <p>Rahat Chowdhury &nbsp;4:03 &nbsp;</p> <p>This is true. Cool. So Hasibul, who are you?</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;4:07 &nbsp;</p> <p>I am a recent bootcamp grad. I haven&#39;t had my first developer job per se. But I did get hired for a company as an associate integration engineer. They&#39;re in the healthcare space and start Monday. So yeah, you know if only we can celebrate but we&#39;ll have to wait until this whole Covid 19 goes away. And then maybe I can finally give you the stuff I got from London that has just been sitting here. Gathering dust</p> <p><br></p> <p>Rahat Chowdhury &nbsp;4:39 &nbsp;</p> <p>&nbsp;Tell the viewers what you got me from London....or listeners.</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;4:44 &nbsp;</p> <p>I got you Nando sauce. I honestly don&#39;t know why you like their mild sauce. It didn&#39;t taste that good. Honestly, their best sauce is...</p> <p><br></p> <p>Rahat Chowdhury &nbsp;4:52 &nbsp;</p> <p>Is the lemon the mild sauce?</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;4:54 &nbsp;</p> <p>Yes</p> <p><br></p> <p>Rahat Chowdhury &nbsp;4:55 &nbsp;</p> <p>I really like the lemon herb</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;4:58 &nbsp;</p> <p>I like the Wild herb but they Don&#39;t bottle it and got me really angry.And I get you a few other stuff from like Harry Potter. Yeah. Store puff nine and three quarters.. Well, and then I still have your birthday gift for like nine months now.&nbsp;</p> <p><br></p> <p>Rahat Chowdhury &nbsp;5:20 &nbsp;</p> <p>We haven&#39;t seen each other &nbsp;in a while</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;5:23 &nbsp;</p> <p>yeah, or when we do I forget it.</p> <p><br></p> <p>Rahat Chowdhury &nbsp;5:27 &nbsp;</p> <p>All right.</p> <p><br></p> <p>So Hasibul introduced himself, I guess I will too. My name is Rahat and I&#39;m a software engineer in New York City. Graduated boot camp last year. Currently in my first developer job, it&#39;s been about nine months. The reason I know it&#39;s been nine months is because this is the third time that my computer has reminded me to reset my password. They do that every three months.</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;5:55 &nbsp;</p> <p>Good way to remind yourself</p> <p><br></p> <p>Rahat Chowdhury &nbsp;5:59 &nbsp;</p> <p>Cool, so Hasibul. What have you enjoyed so far about this podcast?</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;6:06 &nbsp;</p> <p>Just meeting so many different people and hearing so many different stories? It&#39;s great. There&#39;s a lot of things that I haven&#39;t been exposed to before until I spoke to umm we have these guests on. And it&#39;s wonderful. There&#39;s a lot of really good guests. You know, I don&#39;t want to give away any more spoilers than I already have. But there&#39;s I think there&#39;s something for everybody. And in the future, we expect to like expand the number of people were doing it and the different backgrounds...Tom Holland, what?</p> <p><br></p> <p>Rahat Chowdhury &nbsp;6:42 &nbsp;</p> <p>I said you&#39;re worse than Tom Holland for giving away spoilers.</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;6:47 &nbsp;</p> <p>I mean, that&#39;s what you edit all this before you post.</p> <p><br></p> <p>Rahat Chowdhury &nbsp;6:52 &nbsp;</p> <p>Some of it.</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;6:55 &nbsp;</p> <p>&nbsp;I can say anything. I put up whatever I can, I&#39;ll say if it&#39;s an accident, you just Go ahead and bleep it out. I cut it out. So what about you? What have you enjoyed about this podcast other than trying to beg your wife for new, like electronics and podcast gear?</p> <p><br></p> <p>Rahat Chowdhury &nbsp;7:15 &nbsp;</p> <p>Other than the podcast gear I&#39;ve gotten.</p> <p><br></p> <p>I haven&#39;t really gotten much podcast here it was stuff I&#39;ve already had. But what I liked the most, so far, similar to what you said, meeting a bunch of people talking to them about their different experiences. A couple of the episodes we have are kind of similar, but I like the different viewpoints we get from different guests that we have, because everyone has like a different set of life experiences and just overall expertise, even if they might be working in similar fields. So it&#39;s interesting just to see all those different perspectives and learn from them.</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;8:00 &nbsp;</p> <p>No, let&#39;s jump into this one of the, you know, questions I&#39;ve been asking myself to you, I guess for the last two years, like what made you get into programming because I know in high school you never had any inclination towards technology&nbsp;</p> <p><br></p> <p>Rahat Chowdhury &nbsp;8:15 &nbsp;</p> <p>In high school, I had no inclination towards anything.&nbsp;</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;8:19 &nbsp;</p> <p>I mean, other than like, maybe your music, you didn&#39;t really have any inclination towards anything. And then all of a sudden, you just, you know, you came to me like, Hey, I wanna start programming like, What what made you want to do that?&nbsp;</p> <p><br></p> <p>Rahat Chowdhury &nbsp;8:32 &nbsp;</p> <p>So there&#39;s a couple things. My very first introduction to coding or I guess, mainly web development was in eighth grade, Mr. Tsang. He taught us HTML. And that was pretty cool. Then it was cool to like mess around in Myspace and the, you know, those days and trying to I guess, make a super cool Myspace profile.</p> <p><br></p> <p>Did you have one of those glittery mice curses or something you did there? Yeah, I totally forgot what like my pages to be like, but yeah.</p> <p><br></p> <p>Yeah, so that was my very brief introduction into web development.</p> <p><br></p> <p>And then I had started a career and customer service, because music didn&#39;t pay the bills, and kind of like built my way up into management there. And one of my last jobs, I interacted a lot with engineers, whenever we had bugs to fix and all that. It was really cool just to see. Bugs come back fixed and engineers were able to just like go in and mess around with some code and fix the customer experience for people who were going through something Not ideal. And that interested me a lot. I wanted to do that myself. And I remember saying that to my wife and she was really supportive and push me to like, go, you know, give it a shot, try for a boot camp. She was super supportive the whole way and believed in me told me no, I could do this. And that was a big reason why I felt like yeah, you know, let me dive into this and go do it. Yeah, so big reason for coding was was because of her and went to find that boot camp. Hasibul actually helped me find a boot camp was trilogy boot camp, and started that and pretty much fell in love with web development in general. And yeah, here I am now. Developer getting paid to code Yeah.</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;10:58 &nbsp;</p> <p>You know, trilogy owes me like Three referral bonuses</p> <p><br></p> <p>Rahat Chowdhury &nbsp;11:01 &nbsp;</p> <p>For real, its me and two other mutual friends all in the bootcamp&nbsp;</p> <p><br></p> <p>All at the same time I&#39;m like where is my money.</p> <p><br></p> <p>you know, I was you know wanting to join with you and I&#39;m kind of glad I held off here</p> <p><br></p> <p>Why because you didn&#39;t want to join with me?&nbsp;</p> <p><br></p> <p>I did but I&#39;m kind of glad I didn&#39;t just to get you know things in order my personal stuff in order and you know, I went to Flatiron it was a different experience than what you had. And on the whole WeWork debacle, made things a little difficult, but I was glad like flatiron was mostly independent of itself from we work so it wasn&#39;t totally affected. I&#39;m glad and like the people I met I&#39;m pretty sure you can say about your cohort too are really great and I see myself being closer to them then Like I had anyone during college. I don&#39;t know about you, but like, Yeah, right. Exactly. College was like, oh, whatever.</p> <p><br></p> <p>Definitely. I think in the boot camp, it was just a bunch of us who were just going through the same similar type of thing, wanting something wanting to change. Pretty much all of us were career changers. And we were all coming from somewhere places.</p> <p><br></p> <p>So I think there&#39;s a little bit easier to connect with people in that way.</p> <p><br></p> <p>Yeah, I think that&#39;s one of the good things about the good boot camp, you know, are some not so good one there. I&#39;m not gonna get into names. I&#39;m pretty sure you can do a quick Google search and find out a few articles. You know, one of the good things I like about boot camps is that it allows people of all different backgrounds, personal and professional to switch the careers have become a developer, right? Or even those hybrid roles like in the last couple years. There&#39;s so many hybrid, like sales and tech or type of project management. There&#39;s so many different things that are coming about just because code is allowing for all these new things to be done. And there isn&#39;t enough people in the workforce that have that experience in boot camp. That&#39;s where boot camps come in. And like, fill that gap.</p> <p><br></p> <p>Yeah, definitely. I think we&#39;ve had a couple people on our show already been in some of those hybrid roles. So it&#39;s awesome to see like, not just like developer roles being opened up, but just new, cool roles in tech where people can actually shine and have some of their other experiences mixed in with tech as well. So here&#39;s another question. What&#39;s an episode that you&#39;re looking forward to people hearing?</p> <p><br></p> <p>There&#39;s quite a few you know, I really liked all the episodes. Like I said, Earlier I learned a lot. But as I mentioned, like one of my main goals of doing this podcast was just to get people marginalized groups a voice. And there are quite a few right now two are coming up to mind, and I think Rahat knows what I&#39;m talking about. And I can&#39;t wait for people to listen to those they provide...&nbsp;</p> <p><br></p> <p>I think we can give some light spoilers.</p> <p><br></p> <p>Light spoilers? Who Who do you think we&#39;re about to say?&nbsp;</p> <p><br></p> <p>You can pick one and I&#39;ll pick one and we will spoil those.&nbsp;</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;14:32 &nbsp;</p> <p>Okay, in the count of three Let&#39;s say them together and see if the same one.</p> <p><br></p> <p>Rahat Chowdhury &nbsp;14:37 &nbsp;</p> <p>Yeah</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;14:38 &nbsp;</p> <p>1, 2, 3 code cooperative. You didn&#39;t say anything. Oh, my God, I hate you.</p> <p><br></p> <p>Yeah, one of the you know, guests that I really enjoyed talking with was umm code cooperative and the work they&#39;re doing for People that have been in the justice system, and it&#39;s great how they&#39;re helping people who might have never had a chance switching into, you know, or cannot afford a boot camp, or go to college and get a CS degree and get their hands into tech. It&#39;s really great. I, you know, I don&#39;t want to give away any more information. I think everyone just should listen to that episode. There&#39;s a lot of good details. And I don&#39;t want to butcher certain program names. It&#39;s been a couple of weeks. So just look out for that episode.</p> <p><br></p> <p>Rahat Chowdhury &nbsp;15:39 &nbsp;</p> <p>Yeah, there&#39;s a couple episodes I&#39;m looking forward to where we talk a little bit about mental health and tech, mental health advocate myself and yeah, there&#39;s some cool stuff that are is going on in that space. One of those episodes actually, you know, hosted on my own and took on a role of being the one and only host of Tech4Humans.</p> <p><br></p> <p>I feel like you kind of throw some shade there.</p> <p><br></p> <p>I, I don&#39;t know what that. Well, I&#39;m sorry if you felt that way. But that was completely my intention. Oh,</p> <p><br></p> <p>Unknown Speaker &nbsp;16:24 &nbsp;</p> <p>once again think you&#39;re holding down the fort and doing that episode by yourself. You know, sometimes life gets in the way, and can&#39;t do anything.</p> <p><br></p> <p>Rahat Chowdhury &nbsp;16:35 &nbsp;</p> <p>I think we can announce our first episode. What&#39;s our first episode?</p> <p><br></p> <p>Unknown Speaker &nbsp;16:41 &nbsp;</p> <p>first episode is with Pete codes, who runs no CS degree. And he&#39;s across the pond. I don&#39;t know if he would appreciate us saying that.&nbsp;</p> <p><br></p> <p>Rahat Chowdhury &nbsp;16:50 &nbsp;</p> <p>Maybe not</p> <p><br></p> <p>Unknown Speaker &nbsp;16:53 &nbsp;</p> <p>But I know he does a lot of work to highlight how people are switching careers. Becoming developers. And the work he&#39;s doing it&#39;s like giving people hope or you know, showing them maybe a road or path on the way to changing their careers and bettering themselves and that&#39;s great. You know, I don&#39;t want to give away the whole episode, but what he&#39;s doing is great and I really love his mission.&nbsp;</p> <p><br></p> <p>Rahat Chowdhury &nbsp;17:27 &nbsp;</p> <p>So, in every episode we&#39;ve recorded so far, at the end, we usually have a catch up session, Hasibul what are you doing outside of this podcast?</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;17:40 &nbsp;</p> <p>You know trying to teach my six year old how to play Mario Kart.</p> <p><br></p> <p>I have turned on like every little helpful thing for her. You know auto acceleration auto steer, but she just loves hitting the wall and justbut it is getting better every day. And then you know, trying to get her into games and technology um I bought her a frozen to Kana set I think that&#39;s Kino Cano. You know, you showed me like the Harry Potter one like to use the wand to code. Yeah. So I got her the Frozen 2 set for her birthday.</p> <p><br></p> <p>Rahat Chowdhury &nbsp;18:21 &nbsp;</p> <p>hooks up to her iPads are trying to slowly teach her to code there. And that&#39;s about it. I wanted to get Animal Crossing, but I felt like that wouldn&#39;t be the best use of my time right now since she won&#39;t let me play anything beside Mario Kart.</p> <p><br></p> <p>So I got Animal Crossing.</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;18:42 &nbsp;</p> <p>Yes, you did. Did you name your island? What is it?</p> <p><br></p> <p>Rahat Chowdhury &nbsp;18:47 &nbsp;</p> <p>I don&#39;t even remember what I named it.</p> <p><br></p> <p>Unknown Speaker &nbsp;18:51 &nbsp;</p> <p>You said you were spending like 24 hours trying to figure out a name.&nbsp;</p> <p><br></p> <p>Rahat Chowdhury &nbsp;18:54 &nbsp;</p> <p>So I named my island Asgard.&nbsp;</p> <p><br></p> <p>Unknown Speaker &nbsp;18:56 &nbsp;</p> <p>Okay, I thought we were gonna do some Harry Potter theme I named Maybe like her name it like contour or something.</p> <p><br></p> <p>Rahat Chowdhury &nbsp;19:04 &nbsp;</p> <p>You say I was trying to figure out where like Salazar Slytherin was born because the books are extremely biased towards Gryffindors and only give you information about Gryffindor</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;19:15 &nbsp;</p> <p>What? no JK Rowling is very unbiased.</p> <p><br></p> <p>Rahat Chowdhury &nbsp;19:21 &nbsp;</p> <p>Yeah but instead of making something up I decided to go with Asgard</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;19:27 &nbsp;</p> <p>That&#39;s good. That&#39;s good.Now, you know, how many hours have you put into it?&nbsp;</p> <p><br></p> <p>Rahat Chowdhury &nbsp;19:32 &nbsp;</p> <p>Not many yet. I&#39;ve been doing some other stuff working out some of my incredibly long list of side projects. And, yeah. I also live stream on Monday nights. So that&#39;s a self promotion.</p> <p><br></p> <p>Unknown Speaker &nbsp;19:53 &nbsp;</p> <p>Are you going to actually keep live streaming? I know you skipped a couple weeks</p> <p><br></p> <p>Rahat Chowdhury &nbsp;19:57 &nbsp;</p> <p>Yeah I skipped a couple weeks so I was a little burned out from it, but I think we&#39;re back into a good pace.</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;20:05 &nbsp;</p> <p>That&#39;s great.I will be there to troll you every now and then &nbsp;</p> <p><br></p> <p>Rahat Chowdhury &nbsp;20:10 &nbsp;</p> <p>I really appreciate you trolling me. I look forward to that the most.</p> <p><br></p> <p>Thank you for listening to this episode of Tech4Humans. If you enjoyed this episode, please share it with your friends. You can tweet us at @tech4humansio and listen to all of our episodes at tech4humans.io.</p> <p><br></p> <p>Transcribed by https://otter.ai</p> <p><br></p>"
  },
  {
    "episode": "Tech4HumansEpisode1",
    "shortName": "Episode 1",
    "additionalContent": "<a href='https://twitter.com/petecodes'> Follow Pete on Twitter </a> <a href='https://twitter.com/noCSdegree'> Follow No CS Degree on Twitter </a> <a href='https://www.nocsdegree.com/'> No CS Degree Blog </a> <a href='https://nocsok.com/'> No CS Ok job board </a> <a href='https://www.bootcampindex.com/'> BootCamp Index </a>",
    "note": "",
    "transcript": "<p>Rahat Chowdhury &nbsp;0:15 &nbsp;</p> <p>Hey, I&#39;m Rahat. &nbsp;&nbsp;</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;0:17 &nbsp;</p> <p>Hi, I&#39;m Hasibul. And you&#39;re listening to Tech4Humans.&nbsp;</p> <p><br></p> <p>Rahat Chowdhury &nbsp;0:21 &nbsp;</p> <p>Welcome to Tech for humans podcast. So today we have Pete from no CS degree. Pete, you want to introduce yourself a little bit?&nbsp;</p> <p><br></p> <p>Pete &nbsp;0:28 &nbsp;</p> <p>Yeah, sure. So my name is Pete, I run NoCSDegree, which is a blog where I interviewed developers without the standard computer science degree who&#39;ve gone on to be successful. So they&#39;ve either taught themselves code, or they&#39;ve gone through boot camps. And it&#39;s really about lots of different career changes and inspiring stories about people getting into tech.</p> <p><br></p> <p>Rahat Chowdhury &nbsp;0:54 &nbsp;</p> <p>&nbsp;Is that kind of like what you do full time or?</p> <p><br></p> <p>Pete &nbsp;0:57 &nbsp;</p> <p>Yeah that&#39;s that&#39;s exactly what I do full time. So in addition to that, I&#39;ve also got a side project, which is called nocsok.com which is jobs board for the same audience. So it&#39;s shows you jobs for developers that don&#39;t have CS degrees, because increasingly lots of companies a lot more forward thinking about this, which is awesome. So you get more companies where they&#39;re willing to take someone on who&#39;s a bootcamp grad or maybe just help themselves to code.</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;1:31 &nbsp;</p> <p>That&#39;s great. Is that job board only for the UK local jobs? Or are you doing global because I went on your boot camp index, and I saw I was like, across the board that you had boot camps listed?</p> <p><br></p> <p>Pete &nbsp;1:42 &nbsp;</p> <p>Yeah. Yeah. The job board is Yeah, it&#39;s global. It&#39;s funny cuz Yeah, I&#39;m based in Edinburgh in Scotland. And I quite often do sales with like sponsors and companies, and I do get this question a lot. But I think I guess people forget that, obviously, America&#39;s number one country for a lot of things, including tech will make a lot of sense. To answer your question, yes, it is a global jobs board. But yeah, a lot of my my biggest audience by far is America. So, and I think he mentioned just there, I&#39;m developing a new website called boot camp index, which hasn&#39;t been launched properly yet. And it&#39;s kind of in its infancy. But that&#39;s going to be a place where you can see all have boot camps around the world. And you can filter them by things like price, and whether you can defer your payments and even what stack you do. So there&#39;s a few websites already, that talk about boot camps and there are directories but my ones can be a place where you can easily find say I want to learn react in New York City show me a boot camp so I can do this&nbsp;</p> <p><br></p> <p>Rahat Chowdhury &nbsp;3:02 &nbsp;</p> <p>Nice. Yeah,I had that issue kind of like when I was looking for my bootcamp Hasibul actually, like found it for me and sent it I was like, yeah, I&#39;ll apply here. But we were kind of just like scrambling going all over the place like, oh, there&#39;s this boot camp here and that one there and like, I don&#39;t know which one we want to go to. Something like that, I think would be really, really helpful.</p> <p><br></p> <p>Pete &nbsp;3:20 &nbsp;</p> <p>Yeah, I really I really just need to get done and finished. It&#39;s one of those things. One of my friends has messaged me on telegram just this week and is like Pete is it out yet so it&#39;s getting tough friends like hassling me and absolutely keep me going. So yeah, I&#39;m hoping I&#39;m really hoping it&#39;s gonna be out this week. But it&#39;s Yeah, basically like it&#39;s gonna be a way where you can basically filter by things like stack city. Like weather you can do online, but you can do it part time. And this can be a way that you can really Really quickly find out a boot camp for you rather than, I guess a lot of the websites at the moment, it&#39;s more kind of like, you give them your email address, and then they send you a bunch of information. But you know, it doesn&#39;t really give the user a lot of control. So wanting to give the user like the ability to choose boot camp themselves.</p> <p><br></p> <p>Rahat Chowdhury &nbsp;4:21 &nbsp;</p> <p>Nice.That sounds cool.&nbsp;</p> <p><br></p> <p>Pete &nbsp;4:23 &nbsp;</p> <p>So um, what what boot camps Did you go to out of interest?</p> <p><br></p> <p>Rahat Chowdhury &nbsp;4:27 &nbsp;</p> <p>So I went to a trilogy boot camp, so trilogy partners with like a bunch of different universities. So for me, I went to a boot camp at Columbia University. So that was pretty cool. Hasibul is just graduating one right now.</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;4:43 &nbsp;</p> <p>Yeah, no, this is my last week. I&#39;m doing the one at flatiron I saw on your website abd I liked I saw Flatiron, listed.</p> <p><br></p> <p>Pete &nbsp;4:49 &nbsp;</p> <p>like I&#39;ve got some kind of deal happening with Flatiron really soon where I&#39;m gonna interview one of their graduates who&#39;s got a job and Basically Part Two where monetizing The website is working with boot camps. And when they&#39;ve got really positive outcomes, I can do an interview with one through students one through graduates. And then the Yeah, it&#39;s a basically a Yeah, a sponsored post. So for instance, I worked with Haulburton school here in San Francisco. I think it&#39;s their main campus. Okay had students, Laura, who became a developer for Deezer in Paris, after going through their program, so like that as an example, part of the way I made make revenue for the website is they sponsored an article and yeah I interviewed one of the students&nbsp;</p> <p><br></p> <p>Rahat Chowdhury &nbsp;5:51 &nbsp;</p> <p>awesome. So I guess when you&#39;re looking for devs to feature on the side, do you have any type of selection criteria?</p> <p><br></p> <p>Pete &nbsp;5:58 &nbsp;</p> <p>Yeah. I yeah, that&#39;s a very good question. I kind of, I guess it&#39;s maybe a gut thing. I don&#39;t have like a really strict criteria. I guess. It&#39;s probably easier to say if I, if I see someone and like, they have a really, I think is just like a really fun, interesting story. And it appeals to me. I&#39;ll cover them. So there&#39;s one person recently Lee Warrick. Who,&nbsp;</p> <p><br></p> <p>Rahat Chowdhury &nbsp;6:30 &nbsp;</p> <p>Yeah I know Lee.</p> <p><br></p> <p>Pete &nbsp;6:32 &nbsp;</p> <p>&nbsp;Yeah. Oh, really? Yeah. That&#39;s crazy. Yeah. So he was like, he went to do CS at University. And I think, by his own admission, they just didn&#39;t teach him anything useful. Like, I think after one year of college, he could, you know, do hangman in Java, and you know, not really great, not really what you want from university right, He became a firefighter. And then he became a nurse. So there are two very different things. And then he wound up getting back into coding. He went to boot camp. And then he&#39;s now a developer. So that, to me is a good story. There&#39;s other people like, one I refer to alot would be Taylor Alexis, who is an American programmer. She&#39;s very big on Twitter. And she taught herself to code during the evenings after working as a, you know, as a waitress in the fast food restaurant. And everyday she just walked home code for a few hours, go to sleep. And then do you, you know, her like 9/10 hour shifts next day, and then code afterwards. And yeah, now she&#39;s doing really well as a developer. So there&#39;s no like strict criteria. I guess it&#39;s a case of if you have a job as a developer, and I think your story is Interesting, then. That&#39;s that&#39;s the the main things for me really.</p> <p><br></p> <p>Rahat Chowdhury &nbsp;8:05 &nbsp;</p> <p>Gotcha. Yeah. That&#39;s awesome.</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;8:08 &nbsp;</p> <p>That&#39;s great. And I had a question like, what are you using to like power these websites? So you&#39;ve mentioned No CS Degree, the job board, and Bootcamp Index.</p> <p><br></p> <p>Pete &nbsp;8:19 &nbsp;</p> <p>Yeah, sure. So basically, the blog is powered by ghost, which is a nonprofit blog, which blogging platform, which is actually set up by someone who&#39;s very senior WordPress, and they have a bunch of them. I don&#39;t know exactly about the politics, but a bunch of them broke away from WordPress, decided to do their own thing. And so yeah, ghost is really great. It&#39;s very popular. It&#39;s very good because it doesn&#39;t have a I mean, it&#39;s just got a lot of positives. Everything just kind of works out the books. It&#39;s got SEO tools, it&#39;s got things like everything all the there is an option where you can host it for really cheap and like digitalocean for like $5 or something but I pay like I think I pay like $35 and they take care of you know the hosting so as far as I&#39;m concerned if someone else is dealing with it, if there&#39;s a spike in traffic, then that&#39;s better for me to use, I use MailChimp at the moment for the newsletters, so that goes out on Tuesdays and Thursdays now. And so that&#39;s about it for the blog for the jobs board and boot camp index at the moment I use this this website called sheet two sites by Ukrainian blogger, friend of mine, not blogger sorry developer, Ukrainian developer cold Andre Asmath. And here&#39;s the guy, there&#39;s has to be a game boot camp index out there. And it&#39;s really simple actually, it&#39;s basically a way that you can use a Google Sheet as your as your back end as your content management system. So the front end is in bootstrap. And then the back end is just a Google Sheet. But I am learning through I&#39;m learning some Django at the moment. So I guess what I&#39;d like to do eventually is to be able to Well, I say, eventually, in the next month or two, I&#39;d like to just move towards just, you know, having a solution that I&#39;ve coded myself and that we&#39;re just got well, it&#39;d be cheaper and also I&#39;ve got more flexibility. And yeah, I just like to like not, it&#39;s not great to be like relying on another platform if you if you can like customization sentences that&#39;s generally a good thing.</p> <p><br></p> <p>Rahat Chowdhury &nbsp;11:02 &nbsp;</p> <p>Yeah. So are you kind of like on a journey to learn to code as well?</p> <p><br></p> <p>Pete &nbsp;11:05 &nbsp;</p> <p>Yeah. Yeah, it&#39;s a very bad situation. I start Yeah, I&#39;ve been kind of like learning to code on and off for a couple of years. And in summer, last summer, I launched no CS degree. And it was really it was really something to keep myself motivated. And like, I was already speaking to friends on Twitter and telegram. And like, I&#39;d see lots of people that had really cool stories or making cool websites, and had cool jobs. And they, and like, I&#39;ve asked a lot of them like, oh, did you like do Computer Science at university? Because you know, you just got this job for a year or, like, you know, $10,000 a month or something and you&#39;re 21 which is pretty crazy. And a lot of them were like, no, I taught myself or No, I went to this boot camp. So evolved out of that. But so it was really a combination of is really just a case of I was wanting something to keep myself motivated, but then it kind of turned into like my full time jobs. So I have the business side of making the website work have to cover if you can see what I mean, rather than learning code every day, but I have been getting, I&#39;ve been doing better with the learning recently, and I&#39;ve gotten to habit of working through a YouTube series at the moment on django by this developer called Dennis Ivey, and he&#39;s on YouTube, and he&#39;s got like about 2000 subscribers there. And he&#39;s just kind of I guess he&#39;s been he started out fairly recently. So he&#39;s got like a few playlists. It&#39;s around things like Django and react. But he&#39;s Yeah, for whatever reason, like his, his style of teaching really chimes me really well. And he&#39;s got he explains everything really well. So he&#39;s not like a, you know, a really, you know, big name teacher or anything, but I&#39;m just like, Okay, this is cool. And so yeah, so I&#39;m wanting to get up to speed with Python and Django just so I can, yeah, really have the freedom to like, make things exactly how I want them to be really,</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;13:37 &nbsp;</p> <p>other than YouTube. What are the resources do you use to, you know, teach oh sorry to learn</p> <p><br></p> <p>Pete &nbsp;13:44 &nbsp;</p> <p>To learn, I&#39;ll quite often just search for articles or if I&#39;m stuck on something, or if I want to, or if I&#39;m more interested in one area, I&#39;ll just Go on Twitter or go online. And I&#39;ll search you know, I don&#39;t know, like, you can just search for anything you can search, like, you know how to connect to database and Django and come up with that. And so that&#39;s partly how I learn, I guess Also, I&#39;m pretty good at soaking things up just naturally. So like, well, I obviously read all my interviews and I get tips from there. And I&#39;m part of lots of communities and telegram. So I&#39;m part of some communities like maker log, and work in progress, which is wip, also known as wip. They&#39;re, they&#39;re two really good communities, actually, because everyone&#39;s really friendly and super helpful. And they&#39;re quite, they&#39;re relatively small communities. So when I say relatively small, they&#39;re, I guess they&#39;re both like a size or so or maybe a bit more. But it&#39;s if this is the kind of communities where you can ask a relatively dumb question. And someone will be like, Oh, yeah, this is what you need to do. And someone will help you. Whereas</p> <p><br></p> <p>Rahat Chowdhury &nbsp;15:06 &nbsp;</p> <p>So you won&#39;t get like a stack overflow response.</p> <p><br></p> <p>Pete &nbsp;15:07 &nbsp;</p> <p>Yes. Never. I&#39;d never go on there. Because just the worst, this, like, the times of the times, I have asked questions and you get this bot saying, This isn&#39;t a question or this isn&#39;t specific enough, where it&#39;s just, it&#39;s just not a very good human way to interact or anything. So, yeah, &nbsp;maker log is really good. I mean, they are based around, I guess, generally speaking, they&#39;re based around developers or, you know, making indie businesses. So they&#39;re not exclusively about coding, but most people there are really good developers as well. So and, yeah, I think I decided the kind of the StackOverflow most developers are very generous with their time and I guess as well, any time You, I guess a lot of developers as well, anytime you ask them the question, it&#39;s like a challenge. So they&#39;re like, Oh, I want to work. This is I can help this person. So,yeah.</p> <p><br></p> <p>Rahat Chowdhury &nbsp;16:11 &nbsp;</p> <p>Cool. Awesome. So you&#39;ve interviewed quite a lot of people on no CS degree, I guess. Have you noticed any like patterns for the way kind people kind of like learn? And let&#39;s say, someone who&#39;s learning how to code kind of like approached you for advice? What would you say to them?</p> <p><br></p> <p>Pete &nbsp;16:31 &nbsp;</p> <p>Yeah, sure. Um, yeah, I&#39;ve noticed a couple of things. I guess. One of the things would be to, to code every day. I mean, perhaps not the weekend but during the weekdays, yeah. Just I think it&#39;s a generally a good thing to code a little bit every day, even if it&#39;s like an hour or half hour. And I think it&#39;s really just that consistency and making a habit of because It&#39;s I mean, it&#39;s quite, it&#39;s quite a standard thing to, like, this is quite standard thing to say. But it&#39;s kind of like people generally overestimate how much they can do a day and underestimate how much they can do in a year or a lifetime. So, if you, if you go like headfirst and you&#39;re like, I&#39;m gonna spend like five hours a day or 10 hours a day coding, then, you know, you&#39;re probably gonna burn out quite quickly. Whereas if you can keep it steady, and do like an hour, a couple, like however much you can do a day every day for like, you know, a year you&#39;re gonna be in really good position, I think as well. Another thing that&#39;s really good, especially for finding jobs would be to Yeah, just make a little side project and make something that you&#39;re interested in. So I mean, to think about another way if you&#39;re like two people that are wanting to learn Spanish and one person was like, I won&#39;t learn Spanish just so I can learn a language. And another person was, you know, I want to learn Spanish, so I can spend three months with my friends in Mexico, the second person is gonna be a lot more motivated because they&#39;ve got something very specific to aim towards, you know, learning to code is such a, such a huge, broad concept. And, in fact, one of the people I&#39;ve been viewed has Mark colebrook, who makes the wip telegram group he was even saying, like, you know, it&#39;s a bit like learning to talk, you can&#39;t really say exactly like, oh, when does this person learn to code. It&#39;s kind of like a bit by bit gradual process. It&#39;s like, when can you say some can talk or, or when can you say, Oh, this person, this person can speak Spanish tonight. So hopefully, you&#39;ve got something thing, like an interesting thing to have in your resume. Rather than, you know, you don&#39;t really want to be in a situation where you&#39;re doing the same project that, you know, 50 other developers have on their GitHub, because you know, you&#39;re not you&#39;re not standing out that way, of course.</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;19:20 &nbsp;</p> <p>Right. That&#39;s actually a good point that you mentioned about not, you know, having the same project. Everyone knows, like, that&#39;s one of my questions, like when I see these tutorials that people can buy into a lot of them have like, Hey, here&#39;s top 10 tutorials you can make with JavaScript or Python. Now, do you think there&#39;s a way people what people can do to stand out and if you think there&#39;s something people can do to stand out when they&#39;re a bootcamp grad as well, because everyone else ended up doing like, same labs and similar projects when they graduate.</p> <p><br></p> <p>Pete &nbsp;19:55 &nbsp;</p> <p>Yeah, I mean, I guess just there is obviously just the You know, infinite ways the with codes that you can make things different. So if you if you&#39;re all working on the same project on a bootcamp, I guess, you know if you can add another feature which makes it different in some way, or you can, you know, change the design so, it looks different or just, you know, anything that you can think to make it slightly different, but I guess as well, having this is probably somewhere for if you&#39;re probably more of a unique person, then you can probably stand out more because your project could be something completely different. So for instance, one of my mentors is Peter levels, who is obviously someone Well, for those that don&#39;t know he made Nomad list. He&#39;s like a digital nomad. He&#39;s been a big proponent of remote working so If you look at it kind of globally or holistically, he&#39;s a very kind of old guy because he&#39;s like, you know, most people live in the same place, they don&#39;t travel the world. And, you know, he&#39;s kind of been able to make living out of this niche because he has a kind of a different lifestyle, because he&#39;s, you know, working remotely from all these countries. So if you have some kind of like, a distinct hobby, or something like that, you can make a website around that and you could stand out. So if you were, I don&#39;t know, if you&#39;re someone that likes coding, but you&#39;re also like, a into art, you could make a website for finding like, I know, the best galleries when you go abroad or something like that, you know, I mean, so definitely having having unique interests are good because then you can make unique websites as well,</p> <p><br></p> <p>Unknown Speaker &nbsp;22:03 &nbsp;</p> <p>awesome. You&#39;ve been kind of like, from what I&#39;ve noticed sort of cultivating community. You started like a slack group I noticed on your site, and you&#39;ve got like a sort of a list sharing resources that people have learned to code with on no cs degree, based on people you&#39;ve interviewed. Is that correct?</p> <p><br></p> <p>Pete &nbsp;22:22 &nbsp;</p> <p>Yeah, yeah, that&#39;s correct. Yeah, I&#39;ve got basically a Yeah, I&#39;ve got a on the menu bar for no CS degree. I&#39;ve got a list for I&#39;ve gone through. I&#39;ve so I&#39;ve interviewed over 50 developers now and a lot of them have gone through popular online tutors like West bos is one who is very popular and Brad traversey and a whole bunch of other guys. Lots of people that are on that have Udemy courses. So yeah, there&#39;s a It&#39;s hard to keep it up to date, because there&#39;s people providing courses all the time. But yeah, there&#39;s definitely, yeah, there&#39;s resources there. So the people, I mean, I want people to read the articles, but I want also want people to be like to have an action point afterwards, too, right. Yeah.</p> <p><br></p> <p>Rahat Chowdhury &nbsp;23:21 &nbsp;</p> <p>Cool. So you, you mentioned that you kind of like do this full time. Do you get like, kind of like affiliate links for like, kind of referring people to them? Is that kind of like part of your business plan?</p> <p><br></p> <p>Pete &nbsp;23:32 &nbsp;</p> <p>Yeah. That&#39;s part of it. So I&#39;ve had some affiliate income this month for instance, from algo expert. And they&#39;re someone I interviewed, actually, who didn&#39;t have a CS degree and then went on to work at Google. And then he made this product called algo expert where you basically can prepare For technical interviews and get help with algorithms, so it&#39;s good, especially if you&#39;re maybe someone that&#39;s taught themselves to code from home. So yeah, I get so if I mentioned that link in an article and I say, Hey, this is an affiliate link, I&#39;ll get a percentage of that. Yes, some percentage of other affiliate sales like for courses. The main ways I make income, though, are things like my newsletter, which are sponsored. So my blog newsletter for no cs degree is sponsored by Swizec Teller, who&#39;s a programmer who&#39;s got a serverless handbook website. And so...</p> <p><br></p> <p>Rahat Chowdhury &nbsp;24:47 &nbsp;</p> <p>I&#39;m reading through that right now.</p> <p><br></p> <p>Pete &nbsp;24:48 &nbsp;</p> <p>Oh, awesome. That&#39;s cool. Yeah, so obviously I do. And I have other things like boot camps have sponsored some of the articles. So the only Like at the moment, I&#39;ve got, I think I&#39;ve done something about 5500 views and like two or three of the articles have been sponsored, just in case anyone thinks I&#39;m selling out. Yeah, but yeah, it&#39;s a combination of things like some sponsorship from boot camps, newsletter sponsors, sponsorship, affiliate links. Yeah, I think I think that&#39;s most of the and of course, things like the, the jobs board so nosy So okay, so you pay like $99. And you can get your listing, like pinned to the top of that, and that goes out in, in a mailing list as well.</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;25:42 &nbsp;</p> <p>That&#39;s nice. Um, is there any other way for people to like support or contribute to any of your projects?</p> <p><br></p> <p>Pete &nbsp;25:48 &nbsp;</p> <p>Sure. Um, I mean, I would like to say like there&#39;s a people have been very helpful and supportive already. So it&#39;s kind of I kind of started this The last summer and yeah it&#39;s definitely surpassed my expectations so I&#39;ve got like 3000 I think 3300 Twitter followers now you&#39;re all really awesome and everyone yeah everyone&#39;s been really great so I haven&#39;t like a little background for your listeners is this is all boot strapped I don&#39;t pay for advertising so everyone that finds me on Twitter is finding me just organically because they like the content so that&#39;s really good. So yeah, everyone&#39;s been really awesome. I do have a page on buy me a coffee.com and search Yeah, buymeacoffee.com/noCSdegree. So yeah, I kind of when I started, I I was like pushing that a lot. And that got Got some money, like, the first like couple of months before it&#39;s, you know, in the, in the early stages is nice to have like that kind of validation from people willing to like yeah, willing to chip in so i don&#39;t i don&#39;t push it a ton, but at the same time if you want to send me money, that&#39;s fine.</p> <p><br></p> <p>Rahat Chowdhury &nbsp;27:22 &nbsp;</p> <p>I definitely wouldn&#39;t say no to that.</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;27:27 &nbsp;</p> <p>Yeah, um, actualy had a question about you mentioned Peter levels a few times now and that how he&#39;s your mentor. Do you have any advice on people try to find mentors or even mentees on what they should do or look for?</p> <p><br></p> <p>Pete &nbsp;27:42 &nbsp;</p> <p>A Yes, that&#39;s an interesting question. Yeah, I guess. So I guess good places to hang out would be like the telegram groups I mentioned like wip, and maker log and also Twitter. And I think Yeah, just what I would say is like, definitely message people. So, like I&#39;m on Twitter as petecodes, so feel free to message me or tweet me or whatever. And ask me for advice. If I can help. I will do that. So yeah, I think you can just like message lots of people are very helpful in the kind of indie maker kind or indie founders scene. I should also say another really good resources, indie hackers.com, where lots of people are starting businesses without any venture funding. And that&#39;s kind of a mix of technical founders as well as non technical founders. But yeah, I&#39;d say really just shoot someone a message and just try and be precise with what you need help with and they can and hopefully they can help you I&#39;d say that&#39;s a better approach. If someone messaged me and said, Can you be my mentor? I be like, Well, what does that involve? You know, kind of? Yeah, I think if you&#39;re asking that it&#39;s kind of like, it&#39;s maybe formalizing it a bit too much. So when I say, like, I&#39;ve got several people like, I know Peter levels and like courtland Island from indie hackers, and other yeah loads of other founders. But these are just people that I&#39;ve messaged over the years and ask for advice. So I&#39;ve never said like, will you be my mentor? It doesn&#39;t have to be anything as like formal as that. I think they&#39;re really just, you know, if you if you look on Twitter, and you&#39;re, I&#39;m sure you can find people that are in the, they&#39;re making things similar to you. I would say one other point is Don&#39;t like don&#39;t think that some someone like Richard Branson or, you know, a billionaires, most billionaires probably aren&#39;t gonna check their DMS and respond to your requests. I don&#39;t know. I mean, if you like, I don&#39;t know, I don&#39;t really I don&#39;t. Yeah, sorry, I don&#39;t want to go on a rant, but I don&#39;t really get why people are like, Oh, my businesses here, oh, this is, you know, this billionaire. Because they&#39;re never, they&#39;re never gonna message them or they&#39;re never gonna. So it&#39;s a lot better. If you&#39;re looking for a mentor. It&#39;s like look at someone who&#39;s a little bit a head of you, or quite a bit ahead of you, but it&#39;s way easier to get a message back from someone who&#39;s making like 500k, then someone who&#39;s making like, you know, 500 million or we&#39;re 5 billion, you know, this, this people probably aren&#39;t gonna, like, reach back to you straight away. help you with your problem, you know?</p> <p><br></p> <p>Rahat Chowdhury &nbsp;31:02 &nbsp;</p> <p>So yeah, definitely. I think kind of piggybacking off of that.I think if like, if you&#39;re searching for a mentee even just to become a mentor, it&#39;s always like a good thing to just like, try to help someone who&#39;s like a few steps behind you, you know, kind of reinforces your, I guess, your learning of whatever it is you&#39;re helping them with. And, yeah, I think anyone who&#39;s a few steps behind you, you&#39;re probably like the best position to help them because you just kind of went through that.</p> <p><br></p> <p>Pete &nbsp;31:33 &nbsp;</p> <p>Yeah, absolutely. Yeah. I think that that&#39;s the other thing is kind of like, if you&#39;re wanting, if you&#39;re wanting advice from someone, it&#39;s good. That to get it from someone that&#39;s done it like a few months ago, or one or two years ago, as opposed to like, you know, fourty years ago, when things are like yeah, completely different. And yeah, I think it is, I think it is good as well. Like I met someone for coffee in Edinburgh recently, and I was like giving him some advice about sales and things like that and doing cold sales. So, and yeah, it&#39;s also a nice feeling to just say, and yeah, just to help people out. And so so you know, it&#39;s a good way to meet people as well. And you can, you know, you can never have too many friends. So, if someone pings me and like ask for help or something, I&#39;m always happy to help out if I can.</p> <p><br></p> <p>Unknown Speaker &nbsp;32:33 &nbsp;</p> <p>Cool. So yeah, we can wrap up with like a little catch up session, something we&#39;d like to do. How&#39;s life been kind of like outside of your work with no CS degree?</p> <p><br></p> <p>Pete &nbsp;32:43 &nbsp;</p> <p>Yeah, it&#39;s really good. I do I&#39;m very active so do lots of running with my got a running club in Edinburgh called each three milers so I got them a lot for runs and have joined The gym recently which has a swimming pool, so doing lots of swimming and working out there. I just went skiing for a week in France which is nice. And just bit two whole day for to go to Tallinn and then Estonia Yes, I&#39;m gonna do some, you know, some traveling in the next couple months or so,</p> <p><br></p> <p>Rahat Chowdhury &nbsp;33:26 &nbsp;</p> <p>Now that sounds awesome</p> <p><br></p> <p>Pete &nbsp;33:27 &nbsp;</p> <p>yeah yeah no it&#39;s the it&#39;s a good thing about Europe we&#39;ve got like 30 countries packed into the size of the US basically with all with their own language and culture and history and food so it&#39;s Yeah, so it&#39;s good and yeah, I might spend some time over the summer getting some more traveling. I&#39;ve not totally fixed that yet. But um, yeah, things are good. I&#39;d say. Definitely if you&#39;re finding a business, it&#39;s good to have other interests. Apart from business or apart from coding, so, yeah, I do. Yeah. I&#39;ve been like I&#39;ve been exercising a lot recently. So, definitely being able to like go to the gym or go for a long run. And yeah, it&#39;s Yeah, it&#39;s good. It&#39;s refreshing.</p> <p><br></p> <p>Rahat Chowdhury &nbsp;34:17 &nbsp;</p> <p>Yeah, my wife just forced me into a gym membership. So we&#39;ll see how that goes.</p> <p><br></p> <p>Pete &nbsp;34:22 &nbsp;</p> <p>Yeah, it&#39;s good. Trust me. It&#39;s like, everyone. Yeah, doing and doing like an hour of exercise every day. It&#39;s like, yeah, it&#39;s really good.</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;34:32 &nbsp;</p> <p>Thank you for listening to this episode of tech4humans. If you enjoy this episode, please share with your friedns. You can tweet us at @tech4humansio, and listen to all of our episodes at Tech4humans.io that is tech the number four humans.io.</p> <p><br></p> <p>Transcribed by https://otter.ai</p> <p><br></p>"
  }
]