[
  {
    "episode": "Tech4HumansTrailer",
    "shortName": "Trailer",
    "additionalContent": "",
    "note": "",
    "transcript": ""
  },
  {
    "episode": "Tech4HumansEpisode0",
    "shortName": "Episode 0",
    "additionalContent": "<a href='https://twitter.com/Tech4humansio'> Follow Tech4Humans on Twitter </a> <a href='https://twitter.com/Rahatcodes'> Follow Rahat on Twitter </a> <a href='https://twitter.com/hasibulch'> Follow Hasibul on Twitter </a> <a href='https://www.rahatcodes.com/'> Rahat Codes Livestream Archive </a>",
    "note": "",
    "transcript": "<p>Rahat Chowdhury &nbsp;0:15 &nbsp;</p> <p>Hey, I&#39;m Rahat.&nbsp;</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;0:17 &nbsp;</p> <p>Hi, I&#39;m Hasibul.&nbsp;</p> <p><br></p> <p>Rahat Chowdhury &nbsp;0:18 &nbsp;</p> <p>And you&#39;re listening to Tech4Humans.</p> <p><br></p> <p>Welcome to Episode zero of tech for humans. My name is Rahat.</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;0:26 &nbsp;</p> <p>My name is Hasibul.</p> <p><br></p> <p>Rahat Chowdhury &nbsp;0:28 &nbsp;</p> <p>And we&#39;re the co host of tech for humans. So Hasibul, What...what exactly is tech for humans?</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;0:36 &nbsp;</p> <p>Don&#39;t know. You tell me. It&#39;s your idea. You kind of dragged me into this, you know, didn&#39;t give me any choice.</p> <p><br></p> <p>Rahat Chowdhury &nbsp;0:43 &nbsp;</p> <p>I wouldn&#39;t have called it drag.</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;0:45 &nbsp;</p> <p>Okay, you rolled me into this. Okay.</p> <p><br></p> <p>Rahat Chowdhury &nbsp;0:47 &nbsp;</p> <p>Yeah, that&#39;s more accurate. So, I had an idea to do a podcast. And I had no idea what I wanted to do this podcast, so I just wanted to do a podcast. Eventually I got another idea. I wanted to feature people who were just doing good things for humanity. People who may have been doing things for, I guess, marginalized people, maybe for climate change, maybe in the mental health space. And these are some of the people who sought out to feature on episodes on this podcast. And yeah, that&#39;s pretty much the theme that we&#39;ve got going on and the vision that I had for this whole thing. So Hasibul, why are you here?</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;1:25 &nbsp;</p> <p>I think it all started back in 2005.</p> <p><br></p> <p>Rahat Chowdhury &nbsp;1:28 &nbsp;</p> <p>That&#39;s a long time ago&nbsp;</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;1:30 &nbsp;</p> <p>September. I think it was English class</p> <p><br></p> <p>Rahat Chowdhury &nbsp;1:34 &nbsp;</p> <p>Yeah English class.</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;1:36 &nbsp;</p> <p>And you sit in front of me&nbsp;</p> <p><br></p> <p>Rahat Chowdhury &nbsp;1:37 &nbsp;</p> <p>No I sat to the left of you, or you were to the left or I was to the right of you.</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;1:41 &nbsp;</p> <p>I don&#39;t know. We have like a billion classes together.</p> <p><br></p> <p>But yes, started all back then. No,all jokes aside.</p> <p><br></p> <p>Rahat Chowdhury &nbsp;1:53 &nbsp;</p> <p>15 years...</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;1:54 &nbsp;</p> <p>It&#39;s almost 20. I&#39;m sorry. It&#39;s almost 2020. So it would so it &nbsp;hasn&#39;t been 15 years yet. It would have been 15 years and it will be in September. You&#39;re really bad with dates.</p> <p><br></p> <p>Rahat Chowdhury &nbsp;2:07 &nbsp;</p> <p>I&#39;m terrible at dates. Yeah.</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;2:12 &nbsp;</p> <p>But all jokes aside, you know, when you came to me with this, it&#39;s on a really cool. And like I mentioned with you before, like, I want an outlet to be there for everyone, you know, all different groups and walks of lives and especially, you know, marginalized groups, especially like, with us being people of color if you&#39;re like, No, there isn&#39;t a big tech scene for us. Well, yeah, we&#39;re Asian man. And it&#39;s kind of easier for us to get into tech. But just people color in general. It&#39;s not as easy and a lot of the roadblocks are in place to make it hard for us or people. Like us to get into tech and I feel like giving a voice orjust giving an outlet or creating an outletfor groups and people like us would be great. I you know, especially with one of our most recent podcasts that are recorded, you know, it felt really good to talk about a lot of stuff we&#39;ve been dealing with,&nbsp;</p> <p><br></p> <p>Rahat Chowdhury &nbsp;3:20 &nbsp;</p> <p>Don&#39;t give them spoilers...</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;3:23 &nbsp;</p> <p>Well, I try to be as like, spoiler free as possible.</p> <p><br></p> <p>Rahat Chowdhury &nbsp;3:29 &nbsp;</p> <p>Hasilbul &nbsp;has a tendency to give spoilers out</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;3:32 &nbsp;</p> <p>Yea just like how Snape kills Dumbledore.&nbsp;</p> <p><br></p> <p>Rahat Chowdhury &nbsp;3:36 &nbsp;</p> <p>Come on. There are people who may not have read it yet.</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;3:40 &nbsp;</p> <p>You know, it&#39;s been out for over a decade if they haven&#39;t read it or seen it by now. They&#39;re never gonna do it.&nbsp;</p> <p><br></p> <p>Rahat Chowdhury &nbsp;3:46 &nbsp;</p> <p>There are new generations of people.All the time</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;3:49 &nbsp;</p> <p>Oh, they&#39;ve they&#39;ve already seen those spoilers. Tell me not, that half like what half the tweets or like Twitter memes or even reddit memes are about how Snape killed Dumbledore.</p> <p><br></p> <p>Rahat Chowdhury &nbsp;4:03 &nbsp;</p> <p>This is true. Cool. So Hasibul, who are you?</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;4:07 &nbsp;</p> <p>I am a recent bootcamp grad. I haven&#39;t had my first developer job per se. But I did get hired for a company as an associate integration engineer. They&#39;re in the healthcare space and start Monday. So yeah, you know if only we can celebrate but we&#39;ll have to wait until this whole Covid 19 goes away. And then maybe I can finally give you the stuff I got from London that has just been sitting here. Gathering dust</p> <p><br></p> <p>Rahat Chowdhury &nbsp;4:39 &nbsp;</p> <p>&nbsp;Tell the viewers what you got me from London....or listeners.</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;4:44 &nbsp;</p> <p>I got you Nando sauce. I honestly don&#39;t know why you like their mild sauce. It didn&#39;t taste that good. Honestly, their best sauce is...</p> <p><br></p> <p>Rahat Chowdhury &nbsp;4:52 &nbsp;</p> <p>Is the lemon the mild sauce?</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;4:54 &nbsp;</p> <p>Yes</p> <p><br></p> <p>Rahat Chowdhury &nbsp;4:55 &nbsp;</p> <p>I really like the lemon herb</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;4:58 &nbsp;</p> <p>I like the Wild herb but they Don&#39;t bottle it and got me really angry.And I get you a few other stuff from like Harry Potter. Yeah. Store puff nine and three quarters.. Well, and then I still have your birthday gift for like nine months now.&nbsp;</p> <p><br></p> <p>Rahat Chowdhury &nbsp;5:20 &nbsp;</p> <p>We haven&#39;t seen each other &nbsp;in a while</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;5:23 &nbsp;</p> <p>yeah, or when we do I forget it.</p> <p><br></p> <p>Rahat Chowdhury &nbsp;5:27 &nbsp;</p> <p>All right.</p> <p><br></p> <p>So Hasibul introduced himself, I guess I will too. My name is Rahat and I&#39;m a software engineer in New York City. Graduated boot camp last year. Currently in my first developer job, it&#39;s been about nine months. The reason I know it&#39;s been nine months is because this is the third time that my computer has reminded me to reset my password. They do that every three months.</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;5:55 &nbsp;</p> <p>Good way to remind yourself</p> <p><br></p> <p>Rahat Chowdhury &nbsp;5:59 &nbsp;</p> <p>Cool, so Hasibul. What have you enjoyed so far about this podcast?</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;6:06 &nbsp;</p> <p>Just meeting so many different people and hearing so many different stories? It&#39;s great. There&#39;s a lot of things that I haven&#39;t been exposed to before until I spoke to umm we have these guests on. And it&#39;s wonderful. There&#39;s a lot of really good guests. You know, I don&#39;t want to give away any more spoilers than I already have. But there&#39;s I think there&#39;s something for everybody. And in the future, we expect to like expand the number of people were doing it and the different backgrounds...Tom Holland, what?</p> <p><br></p> <p>Rahat Chowdhury &nbsp;6:42 &nbsp;</p> <p>I said you&#39;re worse than Tom Holland for giving away spoilers.</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;6:47 &nbsp;</p> <p>I mean, that&#39;s what you edit all this before you post.</p> <p><br></p> <p>Rahat Chowdhury &nbsp;6:52 &nbsp;</p> <p>Some of it.</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;6:55 &nbsp;</p> <p>&nbsp;I can say anything. I put up whatever I can, I&#39;ll say if it&#39;s an accident, you just Go ahead and bleep it out. I cut it out. So what about you? What have you enjoyed about this podcast other than trying to beg your wife for new, like electronics and podcast gear?</p> <p><br></p> <p>Rahat Chowdhury &nbsp;7:15 &nbsp;</p> <p>Other than the podcast gear I&#39;ve gotten.</p> <p><br></p> <p>I haven&#39;t really gotten much podcast here it was stuff I&#39;ve already had. But what I liked the most, so far, similar to what you said, meeting a bunch of people talking to them about their different experiences. A couple of the episodes we have are kind of similar, but I like the different viewpoints we get from different guests that we have, because everyone has like a different set of life experiences and just overall expertise, even if they might be working in similar fields. So it&#39;s interesting just to see all those different perspectives and learn from them.</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;8:00 &nbsp;</p> <p>No, let&#39;s jump into this one of the, you know, questions I&#39;ve been asking myself to you, I guess for the last two years, like what made you get into programming because I know in high school you never had any inclination towards technology&nbsp;</p> <p><br></p> <p>Rahat Chowdhury &nbsp;8:15 &nbsp;</p> <p>In high school, I had no inclination towards anything.&nbsp;</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;8:19 &nbsp;</p> <p>I mean, other than like, maybe your music, you didn&#39;t really have any inclination towards anything. And then all of a sudden, you just, you know, you came to me like, Hey, I wanna start programming like, What what made you want to do that?&nbsp;</p> <p><br></p> <p>Rahat Chowdhury &nbsp;8:32 &nbsp;</p> <p>So there&#39;s a couple things. My very first introduction to coding or I guess, mainly web development was in eighth grade, Mr. Tsang. He taught us HTML. And that was pretty cool. Then it was cool to like mess around in Myspace and the, you know, those days and trying to I guess, make a super cool Myspace profile.</p> <p><br></p> <p>Did you have one of those glittery mice curses or something you did there? Yeah, I totally forgot what like my pages to be like, but yeah.</p> <p><br></p> <p>Yeah, so that was my very brief introduction into web development.</p> <p><br></p> <p>And then I had started a career and customer service, because music didn&#39;t pay the bills, and kind of like built my way up into management there. And one of my last jobs, I interacted a lot with engineers, whenever we had bugs to fix and all that. It was really cool just to see. Bugs come back fixed and engineers were able to just like go in and mess around with some code and fix the customer experience for people who were going through something Not ideal. And that interested me a lot. I wanted to do that myself. And I remember saying that to my wife and she was really supportive and push me to like, go, you know, give it a shot, try for a boot camp. She was super supportive the whole way and believed in me told me no, I could do this. And that was a big reason why I felt like yeah, you know, let me dive into this and go do it. Yeah, so big reason for coding was was because of her and went to find that boot camp. Hasibul actually helped me find a boot camp was trilogy boot camp, and started that and pretty much fell in love with web development in general. And yeah, here I am now. Developer getting paid to code Yeah.</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;10:58 &nbsp;</p> <p>You know, trilogy owes me like Three referral bonuses</p> <p><br></p> <p>Rahat Chowdhury &nbsp;11:01 &nbsp;</p> <p>For real, its me and two other mutual friends all in the bootcamp&nbsp;</p> <p><br></p> <p>All at the same time I&#39;m like where is my money.</p> <p><br></p> <p>you know, I was you know wanting to join with you and I&#39;m kind of glad I held off here</p> <p><br></p> <p>Why because you didn&#39;t want to join with me?&nbsp;</p> <p><br></p> <p>I did but I&#39;m kind of glad I didn&#39;t just to get you know things in order my personal stuff in order and you know, I went to Flatiron it was a different experience than what you had. And on the whole WeWork debacle, made things a little difficult, but I was glad like flatiron was mostly independent of itself from we work so it wasn&#39;t totally affected. I&#39;m glad and like the people I met I&#39;m pretty sure you can say about your cohort too are really great and I see myself being closer to them then Like I had anyone during college. I don&#39;t know about you, but like, Yeah, right. Exactly. College was like, oh, whatever.</p> <p><br></p> <p>Definitely. I think in the boot camp, it was just a bunch of us who were just going through the same similar type of thing, wanting something wanting to change. Pretty much all of us were career changers. And we were all coming from somewhere places.</p> <p><br></p> <p>So I think there&#39;s a little bit easier to connect with people in that way.</p> <p><br></p> <p>Yeah, I think that&#39;s one of the good things about the good boot camp, you know, are some not so good one there. I&#39;m not gonna get into names. I&#39;m pretty sure you can do a quick Google search and find out a few articles. You know, one of the good things I like about boot camps is that it allows people of all different backgrounds, personal and professional to switch the careers have become a developer, right? Or even those hybrid roles like in the last couple years. There&#39;s so many hybrid, like sales and tech or type of project management. There&#39;s so many different things that are coming about just because code is allowing for all these new things to be done. And there isn&#39;t enough people in the workforce that have that experience in boot camp. That&#39;s where boot camps come in. And like, fill that gap.</p> <p><br></p> <p>Yeah, definitely. I think we&#39;ve had a couple people on our show already been in some of those hybrid roles. So it&#39;s awesome to see like, not just like developer roles being opened up, but just new, cool roles in tech where people can actually shine and have some of their other experiences mixed in with tech as well. So here&#39;s another question. What&#39;s an episode that you&#39;re looking forward to people hearing?</p> <p><br></p> <p>There&#39;s quite a few you know, I really liked all the episodes. Like I said, Earlier I learned a lot. But as I mentioned, like one of my main goals of doing this podcast was just to get people marginalized groups a voice. And there are quite a few right now two are coming up to mind, and I think Rahat knows what I&#39;m talking about. And I can&#39;t wait for people to listen to those they provide...&nbsp;</p> <p><br></p> <p>I think we can give some light spoilers.</p> <p><br></p> <p>Light spoilers? Who Who do you think we&#39;re about to say?&nbsp;</p> <p><br></p> <p>You can pick one and I&#39;ll pick one and we will spoil those.&nbsp;</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;14:32 &nbsp;</p> <p>Okay, in the count of three Let&#39;s say them together and see if the same one.</p> <p><br></p> <p>Rahat Chowdhury &nbsp;14:37 &nbsp;</p> <p>Yeah</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;14:38 &nbsp;</p> <p>1, 2, 3 code cooperative. You didn&#39;t say anything. Oh, my God, I hate you.</p> <p><br></p> <p>Yeah, one of the you know, guests that I really enjoyed talking with was umm code cooperative and the work they&#39;re doing for People that have been in the justice system, and it&#39;s great how they&#39;re helping people who might have never had a chance switching into, you know, or cannot afford a boot camp, or go to college and get a CS degree and get their hands into tech. It&#39;s really great. I, you know, I don&#39;t want to give away any more information. I think everyone just should listen to that episode. There&#39;s a lot of good details. And I don&#39;t want to butcher certain program names. It&#39;s been a couple of weeks. So just look out for that episode.</p> <p><br></p> <p>Rahat Chowdhury &nbsp;15:39 &nbsp;</p> <p>Yeah, there&#39;s a couple episodes I&#39;m looking forward to where we talk a little bit about mental health and tech, mental health advocate myself and yeah, there&#39;s some cool stuff that are is going on in that space. One of those episodes actually, you know, hosted on my own and took on a role of being the one and only host of Tech4Humans.</p> <p><br></p> <p>I feel like you kind of throw some shade there.</p> <p><br></p> <p>I, I don&#39;t know what that. Well, I&#39;m sorry if you felt that way. But that was completely my intention. Oh,</p> <p><br></p> <p>Unknown Speaker &nbsp;16:24 &nbsp;</p> <p>once again think you&#39;re holding down the fort and doing that episode by yourself. You know, sometimes life gets in the way, and can&#39;t do anything.</p> <p><br></p> <p>Rahat Chowdhury &nbsp;16:35 &nbsp;</p> <p>I think we can announce our first episode. What&#39;s our first episode?</p> <p><br></p> <p>Unknown Speaker &nbsp;16:41 &nbsp;</p> <p>first episode is with Pete codes, who runs no CS degree. And he&#39;s across the pond. I don&#39;t know if he would appreciate us saying that.&nbsp;</p> <p><br></p> <p>Rahat Chowdhury &nbsp;16:50 &nbsp;</p> <p>Maybe not</p> <p><br></p> <p>Unknown Speaker &nbsp;16:53 &nbsp;</p> <p>But I know he does a lot of work to highlight how people are switching careers. Becoming developers. And the work he&#39;s doing it&#39;s like giving people hope or you know, showing them maybe a road or path on the way to changing their careers and bettering themselves and that&#39;s great. You know, I don&#39;t want to give away the whole episode, but what he&#39;s doing is great and I really love his mission.&nbsp;</p> <p><br></p> <p>Rahat Chowdhury &nbsp;17:27 &nbsp;</p> <p>So, in every episode we&#39;ve recorded so far, at the end, we usually have a catch up session, Hasibul what are you doing outside of this podcast?</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;17:40 &nbsp;</p> <p>You know trying to teach my six year old how to play Mario Kart.</p> <p><br></p> <p>I have turned on like every little helpful thing for her. You know auto acceleration auto steer, but she just loves hitting the wall and justbut it is getting better every day. And then you know, trying to get her into games and technology um I bought her a frozen to Kana set I think that&#39;s Kino Cano. You know, you showed me like the Harry Potter one like to use the wand to code. Yeah. So I got her the Frozen 2 set for her birthday.</p> <p><br></p> <p>Rahat Chowdhury &nbsp;18:21 &nbsp;</p> <p>hooks up to her iPads are trying to slowly teach her to code there. And that&#39;s about it. I wanted to get Animal Crossing, but I felt like that wouldn&#39;t be the best use of my time right now since she won&#39;t let me play anything beside Mario Kart.</p> <p><br></p> <p>So I got Animal Crossing.</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;18:42 &nbsp;</p> <p>Yes, you did. Did you name your island? What is it?</p> <p><br></p> <p>Rahat Chowdhury &nbsp;18:47 &nbsp;</p> <p>I don&#39;t even remember what I named it.</p> <p><br></p> <p>Unknown Speaker &nbsp;18:51 &nbsp;</p> <p>You said you were spending like 24 hours trying to figure out a name.&nbsp;</p> <p><br></p> <p>Rahat Chowdhury &nbsp;18:54 &nbsp;</p> <p>So I named my island Asgard.&nbsp;</p> <p><br></p> <p>Unknown Speaker &nbsp;18:56 &nbsp;</p> <p>Okay, I thought we were gonna do some Harry Potter theme I named Maybe like her name it like contour or something.</p> <p><br></p> <p>Rahat Chowdhury &nbsp;19:04 &nbsp;</p> <p>You say I was trying to figure out where like Salazar Slytherin was born because the books are extremely biased towards Gryffindors and only give you information about Gryffindor</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;19:15 &nbsp;</p> <p>What? no JK Rowling is very unbiased.</p> <p><br></p> <p>Rahat Chowdhury &nbsp;19:21 &nbsp;</p> <p>Yeah but instead of making something up I decided to go with Asgard</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;19:27 &nbsp;</p> <p>That&#39;s good. That&#39;s good.Now, you know, how many hours have you put into it?&nbsp;</p> <p><br></p> <p>Rahat Chowdhury &nbsp;19:32 &nbsp;</p> <p>Not many yet. I&#39;ve been doing some other stuff working out some of my incredibly long list of side projects. And, yeah. I also live stream on Monday nights. So that&#39;s a self promotion.</p> <p><br></p> <p>Unknown Speaker &nbsp;19:53 &nbsp;</p> <p>Are you going to actually keep live streaming? I know you skipped a couple weeks</p> <p><br></p> <p>Rahat Chowdhury &nbsp;19:57 &nbsp;</p> <p>Yeah I skipped a couple weeks so I was a little burned out from it, but I think we&#39;re back into a good pace.</p> <p><br></p> <p>Hasibul Chowdhury &nbsp;20:05 &nbsp;</p> <p>That&#39;s great.I will be there to troll you every now and then &nbsp;</p> <p><br></p> <p>Rahat Chowdhury &nbsp;20:10 &nbsp;</p> <p>I really appreciate you trolling me. I look forward to that the most.</p> <p><br></p> <p>Thank you for listening to this episode of Tech4Humans. If you enjoyed this episode, please share it with your friends. You can tweet us at @tech4humansio and listen to all of our episodes at tech4humans.io.</p> <p><br></p> <p>Transcribed by https://otter.ai</p> <p><br></p>"
  }
]